<template>
  <header class="header center">
    <div class="header__wrapper">
      <nav class="header-left header__nav">
        <router-link
          class="header-left__menu header__menu"
          v-for="link in leftArr"
          :key="link.id"
          :to="link.url"
        >
          {{ link.name }}
        </router-link>
      </nav>

      <router-link
        class="header-left__logo"
        v-for="link in arr"
        :key="link.id"
        :to="link.url"
      >
        <svg
          class="header-left__svg"
          width="50"
          height="50"
          viewBox="0 0 50 50"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g clip-path="url(#clip0_29114_583)">
            <path
              d="M49.8166 41.723L47.6145 29.3063C48.5218 28.487 49.207 27.4514 49.6063 26.2959C50.0055 25.1404 50.1058 23.9027 49.8979 22.698C49.6899 21.4933 49.1804 20.3608 48.4169 19.406C47.6534 18.4513 46.6606 17.7053 45.5311 17.2376C44.6991 12.4742 42.236 8.14854 38.564 5.00223C34.8921 1.85593 30.2401 0.0849137 25.4054 -0.00720299C20.5708 -0.0993197 15.8546 1.4932 12.0655 4.49734C8.27639 7.50149 5.65029 11.7302 4.63739 16.4584L3.12489 25.0001H6.24989C9.99063 24.977 13.6795 24.1231 17.0499 22.5001C16.8031 22.9469 16.6714 23.448 16.6666 23.9584C16.6637 24.5652 16.8376 25.1597 17.167 25.6693C17.4963 26.1789 17.967 26.5816 18.5214 26.8282C19.0758 27.0748 19.69 27.1547 20.289 27.0581C20.8881 26.9615 21.446 26.6926 21.8948 26.2842C22.3436 25.8758 22.6638 25.3456 22.8162 24.7583C22.9687 24.171 22.9469 23.552 22.7535 22.9768C22.5601 22.4017 22.2034 21.8953 21.727 21.5195C21.2506 21.1437 20.6751 20.9147 20.0707 20.8605C24.5156 18.0872 28.28 14.3499 31.0853 9.92507C29.8585 9.24404 28.525 8.77628 27.1416 8.54174C23.9374 13.2897 17.1186 19.923 8.11031 20.748L8.72489 17.2709C9.57546 13.4105 11.7705 9.97801 14.918 7.58648C18.0656 5.19494 21.9607 4.00001 25.9079 4.21507C29.8551 4.43013 33.5973 6.04117 36.4664 8.76052C39.3355 11.4799 41.1446 15.1305 41.5707 19.0605L41.7332 20.6147L43.2707 20.8917C44.0298 21.0402 44.7068 21.4648 45.1708 22.0836C45.6349 22.7023 45.853 23.4711 45.7831 24.2414C45.7131 25.0116 45.36 25.7285 44.792 26.2535C44.224 26.7785 43.4816 27.0742 42.7082 27.0834C42.5291 27.0834 40.4436 26.7188 40.4436 26.7188L39.8561 28.3855C37.9457 33.7959 31.5207 39.5834 24.9999 39.5834C19.0395 39.5834 13.1707 34.7438 10.7457 29.7917L9.68322 35.7897C11.6643 38.218 14.119 40.2176 16.8978 41.6667H16.6666V45.8334H6.74572C6.35891 45.8321 5.97731 45.744 5.62901 45.5757C5.28072 45.4075 4.97458 45.1632 4.73313 44.861C4.49168 44.5588 4.32106 44.2063 4.23383 43.8294C4.14659 43.4526 4.14496 43.061 4.22906 42.6834L6.62489 29.1417C6.49989 29.1417 6.37697 29.1647 6.24989 29.1647H2.38947L0.135306 41.9063C-0.0645255 42.8862 -0.0439775 43.8983 0.195463 44.8693C0.434903 45.8403 0.887244 46.7459 1.51974 47.5206C2.15224 48.2953 2.94907 48.9196 3.85255 49.3484C4.75603 49.7773 5.74356 49.9999 6.74364 50.0001H20.8332V43.1959C23.5619 43.9348 26.4379 43.9348 29.1666 43.1959V50.0001H43.2541C44.2844 50.0032 45.3015 49.7688 46.2265 49.3149C47.1515 48.8611 47.9594 48.2002 48.5874 47.3834C49.2087 46.5952 49.6422 45.6758 49.8552 44.695C50.0682 43.7143 50.055 42.6979 49.8166 41.723ZM45.2916 44.8334C45.0517 45.1455 44.743 45.3981 44.3897 45.5715C44.0363 45.7449 43.6477 45.8346 43.2541 45.8334H33.3332V41.5709C37.6335 39.2591 41.0863 35.6385 43.1916 31.2334C43.3686 31.223 43.5353 31.173 43.7082 31.1501L45.7478 42.6084C45.8484 42.9894 45.8595 43.3884 45.7804 43.7744C45.7012 44.1603 45.5339 44.5228 45.2916 44.8334ZM30.2082 27.0834C29.5902 27.0834 28.986 26.9001 28.4721 26.5567C27.9582 26.2134 27.5576 25.7253 27.3211 25.1543C27.0846 24.5833 27.0227 23.9549 27.1433 23.3487C27.2638 22.7426 27.5615 22.1857 27.9985 21.7487C28.4356 21.3117 28.9924 21.014 29.5986 20.8934C30.2048 20.7729 30.8331 20.8348 31.4041 21.0713C31.9751 21.3078 32.4632 21.7083 32.8066 22.2222C33.1499 22.7362 33.3332 23.3403 33.3332 23.9584C33.3332 24.7872 33.004 25.5821 32.4179 26.1681C31.8319 26.7542 31.037 27.0834 30.2082 27.0834Z"
              fill="white"
            />
          </g>
          <defs>
            <clipPath id="clip0_29114_583">
              <rect width="50" height="50" fill="white" />
            </clipPath>
          </defs>
        </svg>
      </router-link>

      <nav class="header-right header__nav">
        <router-link
          class="header-right__menu header__menu"
          v-for="link in rightArr"
          :key="link.id"
          :to="link.url"
        >
          {{ link.name }}
        </router-link>

        <div class="burger">
          <input
            type="checkbox"
            name=""
            id="check-menu"
            class="burger__checkbox"
          />

          <label for="check-menu" class="burger__label">
            <div class="burger__block"></div>
          </label>
          <ul class="burger__ul">
            <li class="burger__li">
              <p class="burger__text burger__text_main">
                Мы гарантируем качество наших услуг и готовы ответить на все
                ваши вопросы.
              </p>
            </li>
            <li class="burger__li burger__li_contact">
              <p class="burger__text_title">Контакты</p>
              <p class="burger__text">+7 (812) 123-45-67</p>
              <p class="burger__text">+7 (911) 123-45-67</p>
              <p class="burger__text">Челябинск, проспект Победы, дом 216</p>
            </li>

            <li class="burger__li">
              <p class="burger__text_title">Режим работы</p>
              <p class="burger__text">C 10:00 до 21:00 (Пн-Пт)</p>
              <p class="burger__text">С 11:00 до 20:00 (Сб-Вс)</p>
            </li>
            <router-link
              class="header-left__menu header__menu burger__link"
              v-for="link in leftArr"
              :key="link.id"
              :to="link.url"
            >
              {{ link.name }}
            </router-link>
            <router-link
              class="header-right__menu header__menu burger__link"
              v-for="link in rightArr"
              :key="link.id"
              :to="link.url"
            >
              {{ link.name }}
            </router-link>
          </ul>
          <div class="burger__line burger__line_first"></div>
          <div class="burger__line burger__line_second"></div>
          <div class="burger__line burger__line_third"></div>
          <div class="burger__line burger__line_fourth"></div>
        </div>
      </nav>
    </div>
    <hr class="header__hr" />
  </header>
</template>

<script>
export default {
  data() {
    return {
      leftArr: [
        { id: 0, name: "Главная", url: "/" },
        { id: 1, name: "Мастера", url: "/masters" },
        { id: 2, name: "Косметика", url: "/cosmetic" },
      ],
      arr: [
        {
          id: 0,
          url: "/",
        },
      ],

      rightArr: [
        { id: 0, name: "Прайс", url: "/price" },
        { id: 1, name: "Работы", url: "/works" },
        { id: 2, name: "Контакты", url: "/contacts" },
      ],
    };
  },
};
</script>

<style lang="scss" scoped></style>
